//Фінальне завдання:

//Реалізуйте додаток, який дозволить відшукати певний набір заборонених
//слів у файлах.
//Інтерфейс користувача додатка має дозволити ввести або завантажити з файлу набір заборонених слів. 

//Натиснувши на кнопку «Старт», додаток має почати
//шукати ці слова на всіх доступних накопичувачах інформації (жорсткі диски,
//флешки).
//Файли, що містять заборонені слова, мають бути скопійовані у задану папку.
//Крім файлу-оригіналу, створіть новий файл із вмістом файлу-оригіналу,
//в якому заборонені слова замінені на 7 повторюваних символів зірочок (*******).

//Також створіть файл звіту. Він має містити інформацію про всі знайдені файли
//із забороненими словами, шляхи до цих файлів, розмір файлів, інформацію про
//кількість замін тощо. У файлі звіту відобразіть також Топ-10 найпопулярніших
//заборонених слів.
//Інтерфейс програми має показувати прогрес роботи додатка за допомогою
//індикаторів (progress bars). Користувач через інтерфейс додатка може призупинити роботу алгоритму,
//відновити, повністю зупинити.
//За підсумками роботи програми, виведіть результати роботи в елементи користувацького
// інтерфейсу (продумайте, які елементи керування можуть знадобитися).
//Програма обов’язково має використовувати механізми багатопотоковості та синхронізації!
//Програма може бути запущена лише в одній копії. 

//ШІ юзати можна? - ТАК
//додаток має шукати заборонені слова по txt та md файлах? - Можно додати і підримку md файлів

using System;
using System.Collections.Generic;
using WordChecker;

var json = new StreamReader("config.json").ReadToEnd();
var config = System.Text.Json.JsonSerializer.Deserialize<Config>(json);

if (config == null)
{
    Console.WriteLine("Failed to load configuration.");
    return;
}

var inputFilePath = config.InputDirectory;
var outputDirectory = config.OutputDirectory;

var forbiddenWords = new HashSet<string>(File.ReadAllLines(inputFilePath));

var drives = DriveInfo.GetDrives();

var wordsSearcher = new WordsSearcher();
//foreach (var drive in drives)
//{
//    if (drive.IsReady)
//    {
        var words = wordsSearcher.SearchWordsInDirectory("C:\\", forbiddenWords, outputDirectory);
        Console.WriteLine(string.Join(' ', words));
//    }
//}


